Revit 2027 API
ExporterIFCUtils.ComputeAreaOfCurveLoops Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double ComputeAreaOfCurveLoops(
	IList<CurveLoop> curveLoops
)
Public Shared Function ComputeAreaOfCurveLoops (
	curveLoops As IList(Of CurveLoop)
) As Double
public:
static double ComputeAreaOfCurveLoops(
	IList<CurveLoop^>^ curveLoops
)
static member ComputeAreaOfCurveLoops :
        curveLoops : IList<CurveLoop> -> float
Parameters
curveLoops IList<CurveLoop>
Return Value
Double
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace